<?php

return [
    [
        'date' => '1986-11-11', # дата задаетсяс в формате ГГГГ-ММ-ДД
        'name' => 'Елочка',
        # все фамилии которые были
        # если не задано, то не будет притустствовать в расчете
        'second_name' => [
            'Климова',
            'Мурасова',
            'Смолина',
        ],
        # дата того, с кем нужно рассчитать совместимость
        # если не задано, то не будет притустствовать в расчете
        'sovmestimost_date' => '1987-08-12'
    ],

    [
        'date' => '1987-08-12',
        'name' => 'Папинька',
        'second_name' => [
            'Тарабан',
        ],
        'sovmestimost_date' => '1986-11-11',
    ],

    [
        'date' => '1948-12-30',
        'name' => 'Лариса Борисовна',
    ],

    [
        'date' => '',
        'name' => '',
        'second_name' => [
            '',
        ],
        'sovmestimost_date' => '',
    ],

    [
        'date' => '',
        'name' => '',
        'second_name' => [
            '',
        ],
        'sovmestimost_date' => '',
    ],

    [
        'date' => '',
        'name' => '',
        'second_name' => [
            '',
        ],
        'sovmestimost_date' => '',
    ],
];