<?php

return [
    [
        'date' => '11-11-1986', # дата задаетсяс в формате ГГГГ-ММ-ДД
        'name' => 'Елочка',
        # все фамилии которые были
        # если не задано, то не будет притустствовать в расчете
        'second_name' => [
            'Климова',
            'Мурасова',
            'Смолина',
        ],
        # дата того, с кем нужно рассчитать совместимость
        # если не задано, то не будет притустствовать в расчете
        'sovmestimost_date' => '12-08-1987'
    ],

    [
        'date' => '12-08-1987',
        'name' => 'Папинька',
        'second_name' => [
            'Тарабан',
        ],
        'sovmestimost_date' => '11-11-1986',
    ],

    [
        'date' => '30-12-1948',
        'name' => 'Лариса Борисовна',
    ],

    [
        'date' => '',
        'name' => '',
        'second_name' => [
            '',
        ],
        'sovmestimost_date' => '',
    ],

    [
        'date' => '',
        'name' => '',
        'second_name' => [
            '',
        ],
        'sovmestimost_date' => '',
    ],

    [
        'date' => '',
        'name' => '',
        'second_name' => [
            '',
        ],
        'sovmestimost_date' => '',
    ],
];

